intrinsic-function/intrinsic-function.tex
% Created 2023-03-21 Tue 12:27
% Intended LaTeX compiler: pdflatex
\documentclass[10pt,oneside,x11names]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{bm}
\usepackage[T1]{fontenc}
\usepackage{cmll}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{interval}  % must install texlive-full
\usepackage{mathtools}
\usepackage{interval}  % must install texlive-full
\usepackage[shortcuts]{extdash}
\usepackage{tikz}
\usepackage[utf8]{inputenc}
\usepackage[top=1.25in,bottom=1.25in,left=1.25in,right=1.25in,includefoot]{geometry}
\usepackage{palatino}
\usepackage{siunitx}
\usepackage{braket}
\usepackage[euler-digits,euler-hat-accent]{eulervm}
\usepackage{fancyhdr}
\pagestyle{fancyplain}
\lhead{}
\chead{\textbf{(c) Brian Beckman, 2023; Creative Commons Attribution-ShareAlike CC-BY-SA}}
\rhead{}
\lfoot{(c) Brian Beckman, 2023; CC-BY-SA}
\cfoot{\thepage}
\rfoot{}
\usepackage{lineno}
\usepackage{minted}
\usepackage{listings}
\usepackage{parskip}
\setlength{\parindent}{15pt}
\usepackage{listings}
\usepackage{xcolor}
\usepackage{textcomp}
\usepackage[atend]{bookmark}
\usepackage{mdframed}
\usepackage[utf8]{inputenc} % usually not needed (loaded by default)
\usepackage[T1]{fontenc}
\newcommand\definedas{\stackrel{\text{\tiny def}}{=}}
\newcommand\belex{BELEX}
\newcommand\bleir{BLEIR}
\newcommand\llb{low-level \belex}
\newcommand\hlb{high-level \belex}
\BeforeBeginEnvironment{minted}{\begin{mdframed}}
\AfterEndEnvironment{minted}{\end{mdframed}}
\bookmarksetup{open, openlevel=2, numbered}
\DeclareUnicodeCharacter{03BB}{$\lambda$}
\author{Brian Beckman, Ondřej Čertik}
\date{20 Mar 2023}
\title{Programming Patterns for ASR}
\hypersetup{
 pdfauthor={Brian Beckman, Ondřej Čertik},
 pdftitle={Programming Patterns for ASR},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 of 2019-04-12, org version: 9.2.2},
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents

\setlength\parindent{0pt}

\section{Change Log}
\label{sec:org91c10ca}

2023-21-Mar :: Add section on dynamic binding.
