intrinsic-function/intrinsic-function.org
* What?

Let's simplify some C++ code. We can't easily run it in this
document, because it depends on a big tree of includes, but we can
look at it and figure out what it's trying to do.

The first thing to do is to indent this properly, to make the
structure obvious and to expose patterns. Standard C++ indentation
is less than helpful.

In Listing \ref{fig:typical-node-creation}, we see pushing back
(appending) an assignment statement to the body of something we're
building up. The assignment statement has five parameters:

1. an /allocator/: src_c++[:exports code]{Allocator & al}

2. a /location/, e.g., =file=, =line=, =column=: src_c++[:exports
   code]{const Location & a_loc}

3. a /target/ expression: src_c++[:exports code]{expr_t * a_target},
   usually a =Var=

4. a source or /value/ expression: src_c++[:exports code]{expr_t *
   a_value}

5. an /overloaded/, src_c++[:exports code]{stmt_t * a_overloaded},
   meaning obscure at present

This particular assignment statement assigns or /binds/ the result
of a function call to a variable.

#+caption: Typical Node Creation
#+label: fig:typical-node-creation
#+begin_src C++ :eval never
  body.push_back(
      al, // Allocator  & al
      ASRUtils::STMT(
          ASR::make_Assignment_t(
              al,     // Allocator      & al
              loc,    // const Location & a_loc
              // expr_t * a_target
              ASRUtils::EXPR(
                  ASR::make_Var_t(
                      al,          // Allocator      & al
                      loc,         // const Location & a_loc
                      return_var)),// symbol_t       * a_v
              // expr_t * a_value
              ASRUtils::EXPR(
                  ASR::make_FunctionCall_t(
                      al,          // Allocator      & al
                      loc,         // const Location & a_loc
                      s,           // symbol_t       * a_name
                      s,           // symbol_t       * a_original_name
                      call_args.p, // call_arg_t     * a_args
                      call_args.n, // size_t           n_args
                      arg_type,    // ttype_t        * a_type
                      nullptr,     // expr_t         * a_value
                      nullptr)),   // expr_t         * a_dt
              nullptr // stmt_t * a_overloaded
              )));

#+end_src

\newpage
The =STMT= and =EXPR= parameters and arguments correspond to
/terms/ in the ASR grammar (see the file =asr.asdl=):

\vskip 0.26cm
#+begin_src
  expr
    = ...
    | FunctionCall(symbol name, symbol? original_name,
            call_arg* args, ttype type, expr? value, expr? dt)
    | ...
    | Var(symbol v)
    | ...
#+end_src

\vskip 0.26cm
#+begin_src
  stmt
    = ...
    | Assignment(expr target, expr value, stmt? overloaded)
    | ...
#+end_src

Note that the "factory functions"
- src_c++[:exports code]{ASR::make_FunctionCall_t}
- src_c++[:exports code]{ASR::make_Var_t}
- src_c++[:exports code]{ASR::make_Assignment_t}
are automatically
generated from the ASR grammar.

Our job is to simplify the /use cases/ for these functions -- the
way they're called in, for example, Listing
\ref{fig:typical-node-creation}, whilst preserving automatic
generation from the grammar.

We'd like to see something like Listing
\ref{fig:simplified-usage}, which removes two levels of
indentation, removes the "always" parameters =al= and =loc=, and
defaults several arguments of pointer type to src_c++[:exports
code]{nullptr}. This is obviously easier on the eyes.

#+caption: Simplified Node Creation
#+label: fig:simplified-usage
#+begin_src C++ :eval never
  body.push_back_ALLOC(
      ASRUtils::make_Assignment_STMT(
          ASRUtils::make_Var_EXPR(
              return_var), // symbol_t       * a_v
          // expr_t * a_value
          ASRUtils::make_FunctionCall_EXPR(
              s,           // symbol_t       * a_name
              s,           // symbol_t       * a_original_name
              call_args.p, // call_arg_t     * a_args
              call_args.n, // size_t           n_args
              arg_type))); // ttype_t        * a_type
#+end_src

In these figures, I supplied the indentation and commentary with
types and names of parameters by hand. Such indentation and
commentary is very helpful and straightforward to implement in the
ASR processor.

How do we get from Figure \ref{fig:typical-node-creation} to
Figure \ref{fig:simplified-usage}? There are several patterns to
exploit to reduce the size and noisiness of this code:

1. Every level, including the $0^{th}$ level, =push_back=, has an
   allocator ref, =& al=. This is probably either always the same
   or it can be supplied as a stack-disciplined, dynamically
   bound free variable.

2. All levels below the first have location arguments. These will
   be likely different for each sub-term -- each =STMT= and
   =EXPR=. These should certainly be supplied as a
   stack-disciplined, dynamically bound free variable.

3. The immediate construction of =EXPR='s around the
   =FunctionCall= node and =Var= nodes to =EXPR= is pure noise.
   These can be replaced by higher-level calls. Likewise with
   the immediate construction of a =STMT= from the =Assignment=
   node.

4. There are multiple ways to default arguments in C++. In our
   case, because the defaulted arguments are last in the parameter
   lists, /overloads/ might be the easiest way to specify them.
   See this reference for more.[fn:: https://en.cppreference.com/w/cpp/language/default_arguments]

* Dynamically Bound Variables

