intrinsic-function/intrinsic-function.tex

\section{What?}
\label{sec:orgd55e568}

Let's simplify some C++ code. We can't easily run it in this
document, because it depends on a big tree of includes, but we can
look at it and figure out what it's trying to do.

The first thing to do is to indent this properly, to make the
structure obvious and to expose patterns. Standard C++ indentation
is less than helpful.

In Listing \ref{fig:typical-node-creation}, we see pushing back
(appending) an assignment statement to the body of something we're
building up. The assignment statement has five parameters:

\begin{enumerate}
\item an \emph{allocator}: \mintinline{c++}{Allocator & al}

\item a \emph{location}, e.g., \texttt{file}, \texttt{line}, \texttt{column}: \mintinline{c++}{const Location & a_loc}

\item a \emph{target} expression: \mintinline{c++}{expr_t * a_target},
usually a \texttt{Var}

\item a source or \emph{value} expression: \mintinline{c++}{expr_t * a_value}

\item an \emph{overloaded}, \mintinline{c++}{stmt_t * a_overloaded},
meaning obscure at present
\end{enumerate}

This particular assignment statement assigns or \emph{binds} the result
of a function call to a variable.

\begin{listing}[htbp]
\begin{minted}[]{c++}
body.push_back(
    al, // Allocator  & al
    ASRUtils::STMT(
        ASR::make_Assignment_t(
            al,     // Allocator      & al
            loc,    // const Location & a_loc
            // expr_t * a_target
            ASRUtils::EXPR(
                ASR::make_Var_t(
                    al,          // Allocator      & al
                    loc,         // const Location & a_loc
                    return_var)),// symbol_t       * a_v
            // expr_t * a_value
            ASRUtils::EXPR(
                ASR::make_FunctionCall_t(
                    al,          // Allocator      & al
                    loc,         // const Location & a_loc
                    s,           // symbol_t       * a_name
                    s,           // symbol_t       * a_original_name
                    call_args.p, // call_arg_t     * a_args
                    call_args.n, // size_t           n_args
                    arg_type,    // ttype_t        * a_type
                    nullptr,     // expr_t         * a_value
                    nullptr)),   // expr_t         * a_dt
            nullptr // stmt_t * a_overloaded
            )));

\end{minted}
\caption{\label{fig:typical-node-creation}Typical Node Creation}
\end{listing}

\newpage
The \texttt{STMT} and \texttt{EXPR} parameters and arguments correspond to
\emph{terms} in the ASR grammar (see the file \texttt{asr.asdl}):

\vskip 0.26cm
\begin{verbatim}
expr
  = ...
  | FunctionCall(symbol name, symbol? original_name,
          call_arg* args, ttype type, expr? value, expr? dt)
  | ...
  | Var(symbol v)
  | ...
\end{verbatim}

\vskip 0.26cm
\begin{verbatim}
stmt
  = ...
  | Assignment(expr target, expr value, stmt? overloaded)
  | ...
\end{verbatim}

Note that the ``factory functions''
\begin{itemize}
\item \mintinline{c++}{ASR::make_FunctionCall_t}
\item \mintinline{c++}{ASR::make_Var_t}
\item \mintinline{c++}{ASR::make_Assignment_t}
\end{itemize}
are automatically
generated from the ASR grammar.

Our job is to simplify the \emph{use cases} for these functions -- the
way they're called in, for example, Listing
\ref{fig:typical-node-creation}, whilst preserving automatic
generation from the grammar.

We'd like to see something like Listing
\ref{fig:simplified-usage}, which removes two levels of
indentation, removes the ``always'' parameters \texttt{al} and \texttt{loc}, and
defaults several arguments of pointer type to \mintinline{c++}{nullptr}. This is obviously easier on the eyes.

\begin{listing}[htbp]
\begin{minted}[]{c++}
body.push_back_ALLOC(
    ASRUtils::make_Assignment_STMT(
        ASRUtils::make_Var_EXPR(
            return_var), // symbol_t       * a_v
        // expr_t * a_value
        ASRUtils::make_FunctionCall_EXPR(
            s,           // symbol_t       * a_name
            s,           // symbol_t       * a_original_name
            call_args.p, // call_arg_t     * a_args
            call_args.n, // size_t           n_args
            arg_type))); // ttype_t        * a_type
\end{minted}
\caption{\label{fig:simplified-usage}Simplified Node Creation}
\end{listing}

In these figures, I supplied the indentation and commentary with
types and names of parameters by hand. Such indentation and
commentary is very helpful and straightforward to implement in the
ASR processor.

How do we get from Figure \ref{fig:typical-node-creation} to
Figure \ref{fig:simplified-usage}? There are several patterns to
exploit to reduce the size and noisiness of this code:

\begin{enumerate}
\item Every level, including the \(0^{th}\) level, \texttt{push\_back}, has an
allocator ref, \texttt{\& al}. This is probably either always the same
or it can be supplied as a stack-disciplined, dynamically
bound free variable.

\item All levels below the first have location arguments. These will
be likely different for each sub-term -- each \texttt{STMT} and
\texttt{EXPR}. These should certainly be supplied as a
stack-disciplined, dynamically bound free variable.

\item The immediate construction of \texttt{EXPR}'s around the
\texttt{FunctionCall} node and \texttt{Var} nodes to \texttt{EXPR} is pure noise.
These can be replaced by higher-level calls. Likewise with
the immediate construction of a \texttt{STMT} from the \texttt{Assignment}
node.

\item There are multiple ways to default arguments in C++. In our
case, because the defaulted arguments are last in the parameter
lists, \emph{overloads} might be the easiest way to specify them.
See this reference for more.\footnote{\url{https://en.cppreference.com/w/cpp/language/default\_arguments}}
\end{enumerate}

\section{Dynamically Bound Variables}
\label{sec:org36a4936}
