intrinsic-function/intrinsic-function.tex

\subsection{Review of Lexical Binding}
\label{sec:org131bb36}

\emph{Lexical binding} is the norm. Roughly, it means ``the place where
a variable acquires its value is obvious from just looking at the
source code.'' It's a simple concept, but tied to a bunch of
unfortunate, but necessary, terminology.

Consider a function \texttt{f} that multiplies its argument, the \emph{bound
variable} \texttt{x}, by the \emph{free variable} \texttt{y}, and returns the
product. Let \texttt{y} be a global variable for the moment; we'll modify
that later. The function \texttt{f} is in \emph{the scope}\footnote{\url{https://en.wikipedia.org/wiki/Scope\_(computer\_science)}}
of the global variable \texttt{y}.

\vskip 0.25cm
\begin{minted}[]{c++}
int y = 6;

int f (int x) { int result = x * y; return result; }

int main () { printf ("yfree = %d, f(xbound=%d) ~~> %d\n",
                      y, 7, f(7)); }
\end{minted}

\begin{verbatim}
yfree = 6, f(xbound=7) ~~> 42
\end{verbatim}


\begin{itemize}
\item Summary of confusing terminology:

\begin{itemize}
\item \texttt{y} is free in the body of \texttt{f}, the opposite of \emph{bound}.

\item \texttt{y} is \emph{not} bound in the body of \texttt{f}.

\item \texttt{y} is \emph{lexically bound} in the body of \texttt{f} and in the
bodies of any other functions in the \emph{scope} of \texttt{y}.

\item \texttt{y} is \emph{globally bound}, meaning its scope is at least the
entire file below the lexical position at which \texttt{y} acquires a
value. Its scope can be enlarged at link time with the help of
\texttt{extern} declarations in other files.
\end{itemize}

\item \texttt{x} more precisely, \texttt{x} is a \emph{parameter} of the function \texttt{f}.
When speaking imprecisely of \texttt{x} as an \emph{argument}, we mean

\begin{quote}
\emph{the  current value of the variable \texttt{x} in a particular invocation of \texttt{f}.}
\end{quote}

In the example above, it's clear that the argument \texttt{7}
is the value of the parameter \texttt{x} in the invocation \texttt{f(7)}.

\begin{itemize}
\item It's best to be very careful to distinguish parameters, which
are variables, from arguments, which are values.

\item The process by which variables acquire values is called
\textbf{\emph{binding}} the variables. In the example above, all binding
of \texttt{x} and \texttt{y} is lexical binding: it's obvious from reading
the source code wherefrom \texttt{x} and \texttt{y} acquire their values.
\end{itemize}

\item \texttt{x} is called a \textbf{\emph{bound variable}} in the body of the function
\texttt{f} because \texttt{x} is a parameter in the parameter list of \texttt{f}.
That's the only thing that \emph{bound variable}, as a single phrase,
means: \emph{in the parameter list}.

\begin{itemize}
\item One must answer ``in the parameter list of \emph{what function}?''
when speaking of a bound variable.

\item The term ``bound variable'' actually has another meaning in
another context: it can mean that the variable has a value,
without pertaining to any other properties of the variable.
This is very bad usage of terminology, because it makes the
term ``bound variable'' ambiguous without the context. We shall
be very careful to avoid that ambiguity.
\end{itemize}

\item \texttt{y} is called a \textbf{\emph{free variable}} in the body of the function
\texttt{f} because \texttt{y} is not a parameter in the parameter list of \texttt{f}.
That's the only thing that \emph{free variable} means: \emph{not in the
parameter list}. Thus, a variable may be free in the body of one
function and bound in the body of another function.

\begin{itemize}
\item Technically, \texttt{y} in some free occurrence and \texttt{y} in some bound
occurrence are \emph{not} the same variables, but the same \emph{names}
referring to different variables. This is a common source of
confusion. One must take care to distinguish \emph{names of
variables}, which are symbols, or sometimes strings, from
\emph{names of storage locations}, which are the variables
themselves. Yes, one may have the same name for different
variables. The situation becomes more piquant with pointers
and with C++ \texttt{\&} references, which permit multiple names for
the same variable.

\item One must answer ``not in the parameter list of \emph{what
function}?'' when speaking of a free variable.

\item The adjectives \emph{bound} and \emph{free}, without other
qualifications, mean \emph{``bound variable'' in the body of some
function} and \emph{``free variable'' in the body of some function},
with the terms ``bound variable'' and ``free variable'' taken as
whole phrases.
\end{itemize}

\item \texttt{y} is \emph{also} a \textbf{\emph{global variable}} in that little program
above. That means that its value, when \texttt{y} occurs free in the
body of the function \texttt{f} or in the body of any other function,
is looked up in the global environment.

\item \texttt{y} is called \textbf{\emph{lexically bound}} in the body of \texttt{f}. That means
that a human reading the program can look around the source code
and find the places where \texttt{y} acquired a value. In this case,
\texttt{y} is statically assigned the value \texttt{6} in the global
environment.

\begin{itemize}
\item Again, the terminology is confusing, and we avoid ambiguity by
never taking shortcuts with the language. \emph{Bound}, by itself,
means one thing, the opposite of \emph{free}, and \emph{lexically bound}
is not just the adverb \emph{lexically} modifying the adjective
\emph{bound}, but a whole phrase denoting an entirely separate
concept.
\end{itemize}
\end{itemize}

\subsection{Dynamically Binding \texttt{y}}
\label{sec:org0521e28}

\vskip 0.26cm
\begin{minted}[]{c++}
int y = 6;

static int push_y = y; // generalize this to a run-time stack

void bind_y(int value) { push_y = y; y = value; }

void unbind_y() { y = push_y; }

int f (int x) { int result = x * y; return result; }

int main () {
    bind_y(17);  // in Python, this would start a "with" block.
    printf ("yfree = %d, f(xbound=%d) ~~> %d\n",
                      y, 7, f(7));
    unbind_y();  // this would end the "with" block.
    printf ("but look, yfree is still %d!\n", y); }
\end{minted}

\begin{verbatim}
yfree = 17, f(xbound=7) ~~> 119
but look, yfree is still 6!
\end{verbatim}


Dynamic binding effects a temporary change to the value of a free
variable, global or not, at run time. The value of a variable is
no longer lexically obvious: one must look up a run-time stack and
not just a lexical nest of bindings. In the example above, we have
a pair of functions that work only for the variable \texttt{y}, and only
for one level of dynamic binding, but that illustrate the concept.

\begin{itemize}
\item The scope of the dynamic binding of \texttt{y} is all the code between
the call of \texttt{bind\_y} and the call of \texttt{unbind\_y}.

\item In the scope of the dynamic binding of \texttt{y}, all free occurrences
of \texttt{y} in the bodies of all functions, no matter how deeply
nested, will have the value \texttt{17}, in this instance.

\item To support nesting of binding scopes, replace the
implementations of \texttt{bind\_y} and \texttt{unbind\_y} with implementations
that employ a stack\footnote{\url{https://cplusplus.com/reference/stack/stack/}}.

\item Generalizing dynamic binding to any variable requires either
special syntax and compiler help in the programming language, as
with \texttt{binding} in
Clojure\footnote{\url{https://clojuredocs.org/clojure.core/binding}} or special
variables in Common Lisp\footnote{\url{https://wiki.c2.com/?SpecialVariable}},
or a global dictionary between variable names as strings, e.g.,
\texttt{"x"}, and their variables, say \texttt{x}, along with a stack for each
variable.

\begin{itemize}
\item Both the footnoted articles above are worth your time to read
if you're not familiar with dynamic binding.
\end{itemize}
\end{itemize}
\end{document}